OriginalKernelv1.0/RegistryOperations.InsertUser.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns="urn:RegistryOperations">
 <SOAP-ENV:Body>
  <ns:InsertUser>
   <userIn>
    <Id>0</Id>
    <RegisterDate></RegisterDate>
    <FLastName></FLastName>
    <SLastName></SLastName>
    <Name></Name>
    <Telephone>0</Telephone>
    <Email></Email>
    <Delegation></Delegation>
    <Direction></Direction>
    <Status></Status>
   </userIn>
  </ns:InsertUser>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
